{
    "projects" : [
        {
            "title": "Tourism Database Management",
            "bodyText": "- Designed database system using MySQL to manage tourist details considering tourists' preferences regarding locations, prices and mode of transport.\n - Implemented table level constraints, validated bookings, and performed data encryption to encrypt passwords and payment methods. \n  - Added computed columns to tables to check the number of days of travel costs. \n  - Analysed users’ past booking data, including locations visited, using python and drawing conclusions to users travel destinations and hidden gems of locations.",
            "links": [
            ],
            "tags" : [
                "MySql",
                "NoSql",
                "MongoDB",
                "Python",
                "pyspark sql"
            ]
        },
        {
            "title": "Amazon Review Sentiment Analysis",
            "bodyText": "- Collected data from Amazon and conducted comprehensive pre-processing, including data cleaning, transformation, wrangling, and reduction using Python and Pandas. \n - Performed exploratory data analysis and visualization using Matplotlib and Seaborn to detect and rectify data inconsistencies prior to machine learning sentiment analysis. \n - Implemented machine learning models including Naive Bayes, Logistic Regression, and LSTM (Long Short Term Memory) using Scikit-learn and Keras, finding that LSTM achieved the highest accuracy of over 80%. , ",
            "links": [
            ],
            "tags" : [
                "Python",
                "Pandas",
                "Matplotlib",
                "Scikit-learn"
            ]
        },
        {
            "title": "Housing Portfolio Dashboard",
            "bodyText": "- Acquired housing data and performed pre-processing including data cleaning, data transformation, data wrangling, and data reduction.\n - Identified, analysed, and interpreted trends and patterns in complex data set.\n - Analysed data using statistical methods and provided reports.",
            "links": [
                {
                    "text": "Tableau",
                    "href": "https://public.tableau.com/app/profile/saiteja8583/viz/HousingPortfolioProject_17114070693410/Dashboard1"
                }
            ],
            "tags" : [
                "Excel",
                "Python",
                "Tableau"
            ]
        }   
    ]
}